software/caTissue/modules/caTissueStaticDataService/schema/Catissue_cacore/Catissue_cacore.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<definitions xmlns="http://schemas.xmlsoap.org/wsdl/" xmlns:tns="http://domain.catissuecore.wustl.edu/Catissue_cacore" xmlns:wsrp="http://docs.oasis-open.org/wsrf/2004/06/wsrf-WS-ResourceProperties-1.2-draft-01.xsd" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/03/addressing" xmlns:wsrbfw="http://docs.oasis-open.org/wsrf/2004/06/wsrf-WS-BaseFaults-1.2-draft-01.wsdl" xmlns:wsrpw="http://docs.oasis-open.org/wsrf/2004/06/wsrf-WS-ResourceProperties-1.2-draft-01.wsdl" xmlns:wns3="http://org.cagrid.dataservice/DataService" xmlns:wns2="http://gov.nih.nci.cagrid.data/DataService" xmlns:wns1="http://security.introduce.cagrid.nci.nih.gov/ServiceSecurity" xmlns:wns0="http://docs.oasis-open.org/wsrf/2004/06/wsrf-WS-ResourceProperties-1.2-draft-01.wsdl" xmlns:ns6="http://domain.catissuecore.wustl.edu/Catissue_cacore/types" xmlns:ns12="gme://caCORE.caCORE/3.2/edu.wustl.catissuecore.domain.sop" xmlns:ns5="gme://caCORE.caCORE/3.2/edu.wustl.catissuecore.domain.pathology.ws" xmlns:ns16="gme://caGrid.caBIG/1.0/gov.nih.nci.cagrid.metadata.service" xmlns:ns23="gme://caGrid.caBIG/1.0/gov.nih.nci.cagrid.metadata.dataservice" xmlns:ns1="gme://caCORE.caCORE/3.2/edu.wustl.common.domain.ws" xmlns:ns24="http://org.cagrid.dataservice.cql/QueryLanguageSupport" xmlns:ns18="http://CQL.caBIG/2/org.cagrid.cql2" xmlns:ns13="gme://caCORE.caCORE/3.2/edu.wustl.catissuecore.domain" xmlns:ns10="gme://caCORE.caCORE/3.2/edu.wustl.catissuecore.domain.pathology" xmlns:ns14="gme://caCORE.caCORE/3.2/edu.wustl.common.domain" xmlns:ns22="http://domain.catissuecore.wustl.edu/Catissue_cacore/CQLResultTypes" xmlns:ns8="gme://caCORE.caCORE/3.2/edu.common.dynamicextensions.domain.integration" xmlns:ns11="gme://caCORE.caCORE/3.2/edu.wustl.catissuecore.domain.shippingtracking" xmlns:ns7="gme://caGrid.caBIG/1.0/gov.nih.nci.cagrid.metadata.security" xmlns:ns25="http://gov.nih.nci.cagrid.data/DataServiceExceptions" xmlns:ns15="gme://caGrid.caBIG/1.0/gov.nih.nci.cagrid.metadata" xmlns:ns17="gme://caGrid.caBIG/1.0/gov.nih.nci.cagrid.metadata.common" xmlns:ns2="gme://caCORE.caCORE/3.2/edu.wustl.catissuecore.domain.sop.ws" xmlns:ns21="http://CQL.caBIG/1/gov.nih.nci.cagrid.CQLResultSet" xmlns:ns0="gme://caCORE.caCORE/3.2/edu.wustl.catissuecore.domain.ws" xmlns:ns4="gme://caCORE.caCORE/3.2/edu.common.dynamicextensions.domain.integration.ws" xmlns:ns19="http://CQL.caBIG/2/org.cagrid.cql2.results" xmlns:ns3="gme://caCORE.caCORE/3.2/edu.wustl.catissuecore.domain.deintegration.ws" xmlns:ns20="http://CQL.caBIG/1/gov.nih.nci.cagrid.CQLQuery" xmlns:ns9="gme://caCORE.caCORE/3.2/edu.wustl.catissuecore.domain.deintegration" name="Catissue_cacore" targetNamespace="http://domain.catissuecore.wustl.edu/Catissue_cacore">
  <import namespace="http://docs.oasis-open.org/wsrf/2004/06/wsrf-WS-ResourceProperties-1.2-draft-01.wsdl" location="../wsrf/properties/WS-ResourceProperties.wsdl" />
  <import namespace="http://docs.oasis-open.org/wsrf/2004/06/wsrf-WS-BaseFaults-1.2-draft-01.wsdl" location="../wsrf/faults/WS-BaseFaults.wsdl" />
  <import namespace="http://org.cagrid.dataservice/DataService" location="./Cql2DataService.wsdl" />
  <import namespace="http://gov.nih.nci.cagrid.data/DataService" location="./DataService.wsdl" />
  <import namespace="http://security.introduce.cagrid.nci.nih.gov/ServiceSecurity" location="./ServiceSecurity.wsdl" />
  <!--============================================================

                      T Y P E S
                      
  ============================================================-->
  <types>
    <schema xmlns="http://www.w3.org/2001/XMLSchema" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:wsrbf="http://docs.oasis-open.org/wsrf/2004/06/wsrf-WS-BaseFaults-1.2-draft-01.xsd" targetNamespace="http://domain.catissuecore.wustl.edu/Catissue_cacore" elementFormDefault="qualified" attributeFormDefault="unqualified">
      <import namespace="http://docs.oasis-open.org/wsrf/2004/06/wsrf-WS-BaseFaults-1.2-draft-01.xsd" schemaLocation="../wsrf/faults/WS-BaseFaults.xsd" />
      <import namespace="http://domain.catissuecore.wustl.edu/Catissue_cacore/types" schemaLocation="./Catissue_cacoreTypes.xsd" />
      <import namespace="gme://caCORE.caCORE/3.2/edu.wustl.catissuecore.domain.sop" schemaLocation="edu.wustl.catissuecore.domain.sop.xsd" />
      <import namespace="gme://caCORE.caCORE/3.2/edu.wustl.catissuecore.domain.pathology.ws" schemaLocation="./edu.wustl.catissuecore.domain.pathology.ws.xsd" />
      <import namespace="gme://caGrid.caBIG/1.0/gov.nih.nci.cagrid.metadata.service" schemaLocation="./xsd/cagrid/types/service/servicemodel.xsd" />
      <import namespace="gme://caGrid.caBIG/1.0/gov.nih.nci.cagrid.metadata.dataservice" schemaLocation="./xsd/cagrid/types/data/data.xsd" />
      <import namespace="gme://caCORE.caCORE/3.2/edu.wustl.common.domain.ws" schemaLocation="./edu.wustl.common.domain.ws.xsd" />
      <import namespace="http://org.cagrid.dataservice.cql/QueryLanguageSupport" schemaLocation="./QueryLanguageSupportMetadata.xsd" />
      <import namespace="http://CQL.caBIG/2/org.cagrid.cql2" schemaLocation="./CQLQueryComponents.xsd" />
      <import namespace="gme://caCORE.caCORE/3.2/edu.wustl.catissuecore.domain" schemaLocation="edu.wustl.catissuecore.domain.xsd" />
      <import namespace="gme://caCORE.caCORE/3.2/edu.wustl.catissuecore.domain.pathology" schemaLocation="edu.wustl.catissuecore.domain.pathology.xsd" />
      <import namespace="gme://caCORE.caCORE/3.2/edu.wustl.common.domain" schemaLocation="edu.wustl.common.domain.xsd" />
      <import namespace="http://domain.catissuecore.wustl.edu/Catissue_cacore/CQLResultTypes" schemaLocation="./Catissue_cacore_CQLResultTypes.xsd" />
      <import namespace="gme://caCORE.caCORE/3.2/edu.common.dynamicextensions.domain.integration" schemaLocation="edu.common.dynamicextensions.domain.integration.xsd" />
      <import namespace="gme://caCORE.caCORE/3.2/edu.wustl.catissuecore.domain.shippingtracking" schemaLocation="edu.wustl.catissuecore.domain.shippingtracking.xsd" />
      <import namespace="gme://caGrid.caBIG/1.0/gov.nih.nci.cagrid.metadata.security" schemaLocation="./xsd/cagrid/types/security/security.xsd" />
      <import namespace="http://gov.nih.nci.cagrid.data/DataServiceExceptions" schemaLocation="./DataServiceExceptions.xsd" />
      <import namespace="gme://caGrid.caBIG/1.0/gov.nih.nci.cagrid.metadata" schemaLocation="./xsd/cagrid/types/caGridMetadata.xsd" />
      <import namespace="gme://caGrid.caBIG/1.0/gov.nih.nci.cagrid.metadata.common" schemaLocation="./xsd/cagrid/types/common/common.xsd" />
      <import namespace="gme://caCORE.caCORE/3.2/edu.wustl.catissuecore.domain.sop.ws" schemaLocation="./edu.wustl.catissuecore.domain.sop.ws.xsd" />
      <import namespace="http://CQL.caBIG/1/gov.nih.nci.cagrid.CQLResultSet" schemaLocation="./1_gov.nih.nci.cagrid.CQLResultSet.xsd" />
      <import namespace="gme://caCORE.caCORE/3.2/edu.wustl.catissuecore.domain.ws" schemaLocation="./edu.wustl.catissuecore.domain.ws.xsd" />
      <import namespace="gme://caCORE.caCORE/3.2/edu.common.dynamicextensions.domain.integration.ws" schemaLocation="./edu.common.dynamicextensions.domain.integration.ws.xsd" />
      <import namespace="http://CQL.caBIG/2/org.cagrid.cql2.results" schemaLocation="./CQLQueryResults.xsd" />
      <import namespace="gme://caCORE.caCORE/3.2/edu.wustl.catissuecore.domain.deintegration.ws" schemaLocation="./edu.wustl.catissuecore.domain.deintegration.ws.xsd" />
      <import namespace="http://CQL.caBIG/1/gov.nih.nci.cagrid.CQLQuery" schemaLocation="./1_gov.nih.nci.cagrid.CQLQuery.xsd" />
      <import namespace="gme://caCORE.caCORE/3.2/edu.wustl.catissuecore.domain.deintegration" schemaLocation="edu.wustl.catissuecore.domain.deintegration.xsd" />
      <element name="InsertRequest">
        <complexType>
          <sequence>
            <element name="object">
              <complexType>
                <sequence>
                  <element ref="ns1:AbstractDomainObject" minOccurs="1" maxOccurs="1" />
                </sequence>
              </complexType>
            </element>
          </sequence>
        </complexType>
      </element>
      <element name="InsertResponse">
        <complexType>
          <sequence>
            <element ref="ns1:AbstractDomainObject" minOccurs="1" maxOccurs="1" />
          </sequence>
        </complexType>
      </element>
      <element name="UpdateRequest">
        <complexType>
          <sequence>
            <element name="object">
              <complexType>
                <sequence>
                  <element ref="ns1:AbstractDomainObject" minOccurs="1" maxOccurs="1" />
                </sequence>
              </complexType>
            </element>
          </sequence>
        </complexType>
      </element>
      <element name="UpdateResponse">
        <complexType>
          <sequence>
            <element ref="ns1:AbstractDomainObject" minOccurs="1" maxOccurs="1" />
          </sequence>
        </complexType>
      </element>
      <element name="DisableRequest">
        <complexType>
          <sequence>
            <element name="object">
              <complexType>
                <sequence>
                  <element ref="ns1:AbstractDomainObject" minOccurs="1" maxOccurs="1" />
                </sequence>
              </complexType>
            </element>
          </sequence>
        </complexType>
      </element>
      <element name="DisableResponse">
        <complexType>
          <sequence>
            <element ref="ns1:AbstractDomainObject" minOccurs="1" maxOccurs="1" />
          </sequence>
        </complexType>
      </element>
      <element name="Catissue_cacoreResourceProperties">
        <complexType>
          <sequence>
            <element ref="ns23:DomainModel" />
            <element ref="ns15:ServiceMetadata" />
            <element ref="ns24:QueryLanguageSupport" />
          </sequence>
        </complexType>
      </element>
    </schema>
  </types>
  <!--  place service messages here -->
  <message name="InsertRequest">
    <part name="parameters" element="tns:InsertRequest" />
  </message>
  <message name="InsertResponse">
    <part name="parameters" element="tns:InsertResponse" />
  </message>
  <message name="UpdateRequest">
    <part name="parameters" element="tns:UpdateRequest" />
  </message>
  <message name="UpdateResponse">
    <part name="parameters" element="tns:UpdateResponse" />
  </message>
  <message name="DisableRequest">
    <part name="parameters" element="tns:DisableRequest" />
  </message>
  <message name="DisableResponse">
    <part name="parameters" element="tns:DisableResponse" />
  </message>
  <message name="QueryProcessingExceptionFaultMessage">
    <part name="fault" element="ns25:QueryProcessingException" />
  </message>
  <!--============================================================

                       P O R T T Y P E
                      
  ============================================================-->
  <portType name="Catissue_cacorePortType" wsrp:ResourceProperties="tns:Catissue_cacoreResourceProperties">
    <operation name="insert">
      <input message="tns:InsertRequest" wsa:Action="http://domain.catissuecore.wustl.edu/Catissue_cacore/InsertRequest" />
      <output message="tns:InsertResponse" wsa:Action="http://domain.catissuecore.wustl.edu/Catissue_cacore/InsertResponse" />
      <fault name="QueryProcessingException" message="tns:QueryProcessingExceptionFaultMessage" wsa:Action="http://domain.catissuecore.wustl.edu/Catissue_cacore/QueryProcessingExceptionFaultMessage" />
    </operation>
    <operation name="update">
      <input message="tns:UpdateRequest" wsa:Action="http://domain.catissuecore.wustl.edu/Catissue_cacore/UpdateRequest" />
      <output message="tns:UpdateResponse" wsa:Action="http://domain.catissuecore.wustl.edu/Catissue_cacore/UpdateResponse" />
      <fault name="QueryProcessingException" message="tns:QueryProcessingExceptionFaultMessage" wsa:Action="http://domain.catissuecore.wustl.edu/Catissue_cacore/QueryProcessingExceptionFaultMessage" />
    </operation>
    <operation name="disable">
      <input message="tns:DisableRequest" wsa:Action="http://domain.catissuecore.wustl.edu/Catissue_cacore/DisableRequest" />
      <output message="tns:DisableResponse" wsa:Action="http://domain.catissuecore.wustl.edu/Catissue_cacore/DisableResponse" />
      <fault name="QueryProcessingException" message="tns:QueryProcessingExceptionFaultMessage" wsa:Action="http://domain.catissuecore.wustl.edu/Catissue_cacore/QueryProcessingExceptionFaultMessage" />
    </operation>
    <wsdl:operation xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" name="GetMultipleResourceProperties">
      <wsdl:input name="GetMultipleResourcePropertiesRequest" message="wsrpw:GetMultipleResourcePropertiesRequest" wsa:Action="http://docs.oasis-open.org/wsrf/2004/06/wsrf-WS-ResourceProperties/GetMultipleResourceProperties" />
      <wsdl:output name="GetMultipleResourcePropertiesResponse" message="wsrpw:GetMultipleResourcePropertiesResponse" wsa:Action="http://docs.oasis-open.org/wsrf/2004/06/wsrf-WS-ResourceProperties/GetMultipleResourcePropertiesResponse" />
      <wsdl:fault name="ResourceUnknownFault" message="wsrpw:ResourceUnknownFault" />
      <wsdl:fault name="InvalidResourcePropertyQNameFault" message="wsrpw:InvalidResourcePropertyQNameFault" />
    </wsdl:operation>
    <wsdl:operation xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" name="GetResourceProperty">
      <wsdl:input name="GetResourcePropertyRequest" message="wsrpw:GetResourcePropertyRequest" wsa:Action="http://docs.oasis-open.org/wsrf/2004/06/wsrf-WS-ResourceProperties/GetResourceProperty" />
      <wsdl:output name="GetResourcePropertyResponse" message="wsrpw:GetResourcePropertyResponse" wsa:Action="http://docs.oasis-open.org/wsrf/2004/06/wsrf-WS-ResourceProperties/GetResourcePropertyResponse" />
      <wsdl:fault name="ResourceUnknownFault" message="wsrpw:ResourceUnknownFault" />
      <wsdl:fault name="InvalidResourcePropertyQNameFault" message="wsrpw:InvalidResourcePropertyQNameFault" />
    </wsdl:operation>
    <wsdl:operation xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" name="QueryResourceProperties">
      <wsdl:input name="QueryResourcePropertiesRequest" message="wsrpw:QueryResourcePropertiesRequest" wsa:Action="http://docs.oasis-open.org/wsrf/2004/06/wsrf-WS-ResourceProperties/QueryResourceProperties" />
      <wsdl:output name="QueryResourcePropertiesResponse" message="wsrpw:QueryResourcePropertiesResponse" wsa:Action="http://docs.oasis-open.org/wsrf/2004/06/wsrf-WS-ResourceProperties/QueryResourcePropertiesResponse" />
      <wsdl:fault name="ResourceUnknownFault" message="wsrpw:ResourceUnknownFault" />
      <wsdl:fault name="InvalidResourcePropertyQNameFault" message="wsrpw:InvalidResourcePropertyQNameFault" />
      <wsdl:fault name="UnknownQueryExpressionDialectFault" message="wsrpw:UnknownQueryExpressionDialectFault" />
      <wsdl:fault name="InvalidQueryExpressionFault" message="wsrpw:InvalidQueryExpressionFault" />
      <wsdl:fault name="QueryEvaluationErrorFault" message="wsrpw:QueryEvaluationErrorFault" />
    </wsdl:operation>
    <operation name="getServiceSecurityMetadata">
      <input message="wns1:GetServiceSecurityMetadataRequest" wsa:Action="http://security.introduce.cagrid.nci.nih.gov/ServiceSecurity/GetServiceSecurityMetadataRequest" />
      <output message="wns1:GetServiceSecurityMetadataResponse" wsa:Action="http://security.introduce.cagrid.nci.nih.gov/ServiceSecurity/GetServiceSecurityMetadataResponse" />
    </operation>
    <operation name="query">
      <input message="wns2:QueryRequest" wsa:Action="http://data.cagrid.nci.nih.gov/DataService/QueryRequest" />
      <output message="wns2:QueryResponse" wsa:Action="http://data.cagrid.nci.nih.gov/DataService/QueryResponse" />
      <fault name="QueryProcessingException" message="wns2:QueryProcessingExceptionFaultMessage" wsa:Action="http://gov.nih.nci.cagrid.data/DataService/QueryProcessingExceptionFaultMessage" />
      <fault name="MalformedQueryException" message="wns2:MalformedQueryExceptionFaultMessage" wsa:Action="http://gov.nih.nci.cagrid.data/DataService/MalformedQueryExceptionFaultMessage" />
    </operation>
    <operation name="executeQuery">
      <input message="wns3:ExecuteQueryRequest" wsa:Action="http://org.cagrid.dataservice/DataService/ExecuteQueryRequest" />
      <output message="wns3:ExecuteQueryResponse" wsa:Action="http://org.cagrid.dataservice/DataService/ExecuteQueryResponse" />
      <fault name="MalformedQueryException" message="wns3:MalformedQueryExceptionFaultMessage" wsa:Action="http://org.cagrid.dataservice/DataService/MalformedQueryExceptionFaultMessage" />
      <fault name="QueryProcessingException" message="wns3:QueryProcessingExceptionFaultMessage" wsa:Action="http://org.cagrid.dataservice/DataService/QueryProcessingExceptionFaultMessage" />
    </operation>
  </portType>
</definitions>

