software/caTissue/modules/caTissueStaticDataService/test/SOAP-XMLs/InsertEmptyParticipant-Object.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema"
                  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
                  xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/03/addressing">
    <soapenv:Header>
    </soapenv:Header>
    <soapenv:Body>
        <InsertRequest xmlns="http://domain.catissuecore.wustl.edu/Catissue_cacore">
            <object activityStatus="Active"
                    firstName="First1323396477620"
                    identifier="0"
                    lastName="Last1323396477620"
                    xsi:type="ns1:Participant"
                    xmlns:ns1="gme://caCORE.caCORE/3.2/edu.wustl.catissuecore.domain.ws">
            </object>
        </InsertRequest>
    </soapenv:Body>
</soapenv:Envelope>
