software/caTissue/modules/caTissueStaticDataService/test/SOAP-XMLs/DisableParticipant-Object.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema"
                  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
                  xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/03/addressing">
    <soapenv:Body>
        <DisableRequest xmlns="http://domain.catissuecore.wustl.edu/Catissue_cacore">
            <object identifier="1" 
                    xsi:type="ns1:Participant" 
		    xmlns:ns1="gme://caCORE.caCORE/3.2/edu.wustl.catissuecore.domain.ws">
                <ns1:collectionProtocolRegistrationCollection>
                    <ns1:CollectionProtocolRegistration>
                    </ns1:CollectionProtocolRegistration>
                </ns1:collectionProtocolRegistrationCollection>
            </object>
        </DisableRequest>
    </soapenv:Body>
</soapenv:Envelope>
