software/caTissue/modules/caTissueStaticDataService/test/SOAP-XMLs/UpdateCollectionProtocol-Object.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema"
                  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
                  xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/03/addressing">
    <soapenv:Body>
        <UpdateRequest xmlns="http://domain.catissuecore.wustl.edu/Catissue_cacore">
            <object activityStatus="Active"
                    aliquotInSameContainer="false"
                    consentsWaived="false"
                    dirtyEditFlag="false"
                    identifier="0"
                    remoteId="1323396477627"
                    remoteManagedFlag="false"
                    title="System Test Site 1323396477620"
                    shortTitle="System Test Site 1323396477620"
                    startDate="2011-12-09T02:07:57.627Z"
                    studyCalendarEventPoint="0.0"
                    xsi:type="ns1:CollectionProtocol"
                    xmlns:ns1="gme://caCORE.caCORE/3.2/edu.wustl.catissuecore.domain.ws">
                <ns1:principalInvestigator>
                    <ns1:User csmUserId="0" dirtyEditFlag="false" firstTimeLogin="false" identifier="1" remoteId="0" remoteManagedFlag="false"/>
                </ns1:principalInvestigator>
                <ns1:collectionProtocolEventCollection>
                    <ns1:CollectionProtocolEvent
                            activityStatus="Active"
                            clinicalDiagnosis="Not Specified"
                            clinicalStatus="Not Specified"
                            collectionPointLabel="CPE - point label"
                            identifier="0"
                            labelFormat="%CP_DEFAULT%"
                            studyCalendarEventPoint="5.0">
                        <ns1:specimenCollectionSite>
                            <ns1:Site dirtyEditFlag="false" identifier="1" remoteId="0" remoteManagedFlag="false"/>
                        </ns1:specimenCollectionSite>
                    </ns1:CollectionProtocolEvent>
                </ns1:collectionProtocolEventCollection>
                <ns1:siteCollection>
                    <ns1:Site dirtyEditFlag="false" identifier="1" remoteId="0" remoteManagedFlag="false"/>
                </ns1:siteCollection>
                <ns1:coordinatorCollection>
                    <ns1:User csmUserId="0" dirtyEditFlag="false" firstTimeLogin="false" identifier="2" remoteId="0" remoteManagedFlag="false"/>
                </ns1:coordinatorCollection>
            </object>
        </UpdateRequest>
    </soapenv:Body>
</soapenv:Envelope>
