software/caTissue/modules/caTissueStaticDataService/test/SOAP-XMLs/InsertCollectionProtocolRegistration-Object.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
                  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <soapenv:Body>
        <InsertRequest xmlns="http://domain.catissuecore.wustl.edu/Catissue_cacore">
            <object activityStatus="Active" 
                    xsi:type="ns1:CollectionProtocolRegistration"
                    xmlns:ns1="gme://caCORE.caCORE/3.2/edu.wustl.catissuecore.domain.ws">
                <ns1:collectionProtocol>
                    <ns1:CollectionProtocol identifier="3"/>
                </ns1:collectionProtocol>
                <ns1:participant>
                    <ns1:Participant identifier="29"/>
                </ns1:participant>
            </object>
        </InsertRequest>
    </soapenv:Body>
</soapenv:Envelope>