software/caTissue/modules/caTissueStaticDataService/test/SOAP-XMLs/UpdateParticipantWithAnnotation-Object.xml

<soapenv:Envelope 
xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" 
xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" 
xmlns:cat="http://domain.catissuecore.wustl.edu/Catissue_cacore"
xmlns:ns1="gme://caCORE.caCORE/3.2/edu.wustl.catissuecore.domain.ws"
xmlns:ann="gme://caCORE.caCORE/3.2/gov.nih.nci.dynext.clinical_annotation"
>
   <soapenv:Header/>
<soapenv:Body>
      <UpdateRequest xmlns="http://domain.catissuecore.wustl.edu/Catissue_cacore">
            <object 
firstName="Steven2" 
identifier="3" 
lastName="Pink2" 
activityStatus="Active"
                    xsi:type="ns1:Participant" 
		    xmlns:ns1="gme://caCORE.caCORE/3.2/edu.wustl.catissuecore.domain.ws">
                <ns1:collectionProtocolRegistrationCollection>
                    <ns1:CollectionProtocolRegistration>
                    </ns1:CollectionProtocolRegistration>
                </ns1:collectionProtocolRegistrationCollection>

<!-- Collections-->
                <ns1:raceCollection>
                    <ns1:Race identifier="7" raceName="Unknown"/>
                    <ns1:Race identifier="6" raceName="White"/>
                </ns1:raceCollection>


		<ns1:participantRecordEntryCollection>
		    <ann:participantRecordEntry>
			<ann:alcoholHealthAnnotationCollection>
				<ann:alcoholHealthAnnotation 
drinksPerWeek="1" 
yearsAgentFree="1"
otherAgent="ABC"
identifier="3" 
activityStatus="Inactive"/>
			</ann:alcoholHealthAnnotationCollection>
		    </ann:participantRecordEntry>
		</ns1:participantRecordEntryCollection>

         </object>
      </UpdateRequest>
   </soapenv:Body>
</soapenv:Envelope>